# Tap is for installing homebrews own additional packages
# Brew is for install terminal libraries
# Cask is for installing applications

tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# aws cli
brew "awscli"
# Distributed revision control system
brew "git"
# UNIX shell (command interpreter)
brew "zsh"
# Python code formatter
brew "black"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Needed to build python
brew "openssl"
# Needed to build python
brew "readline"
# Needed to build python
brew "sqlite3"
# Needed to build python
brew "xz"
# Needed to build python
brew "zlib"
# cmake
brew "cmake"
# Mac App store CLI
brew "mas"
# file sending
brew "croc"
# Image handling
brew "ffmpeg"
# pulumi
brew "pulumi"
# Java runtime
brew "java"
# Unknown but needed
brew "jq"
# Google chrome
cask "chromium"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for GitHub repositories
cask "github"
# Video Conferencing
cask "zoom"
# Containerisation
cask "docker"